---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.Voltage
source: html/f0c134b8-7a0f-ebf0-48d1-e6d1ca03aad4.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.Voltage Property

The Voltage value of the Electrical System.

## Syntax (C#)
```csharp
public double Voltage { get; }
```

## Remarks
This property is used to retrieve the Voltage value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!